Revit 2027 API
StructuralSectionGeneralT.GetFlangeThicknessInFlangeCenter Method
 Returns thickness of flange measured in the 0.25 * (width - webThickess), sometimes used for sections with width > 300 mm.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetFlangeThicknessInFlangeCenter()
Public Function GetFlangeThicknessInFlangeCenter As Double
public:
double GetFlangeThicknessInFlangeCenter()
member GetFlangeThicknessInFlangeCenter : unit -> float
Return Value
Double
See Also
Reference
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace